app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" ORDER BY "carts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @carts = Cart.all