app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-01-19 20:48:07.064501"], ["updated_at", "2022-01-19 20:48:07.064501"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["cart_id", 15], ["created_at", "2022-01-27 18:06:08.639166"], ["updated_at", "2022-01-27 18:06:08.639166"], ["price", 10]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2022-01-22 13:46:28.948555"], ["id", 21]]