app/controllers/orders_controller.rb

    def ensure_cart_isnt_empty
      if @cart.line_items.empty?
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 7], ["LIMIT", 1]]