app/controllers/store_controller.rb

  def index
    @counter = store_counter
    @counterMessage = "You have accessed this page #{@counter}" if @counter > 5 #gjør om denne til spansk senere?
    if params[:set_locale]
      redirect_to store_index_url(locale: params[:set_locale])
    else
      @products = Product.order(:title)
---
SELECT "products".* FROM "products" ORDER BY "products"."title" ASC