app/mailboxes/support_mailbox.rb

  def process
    recent_order = Order.where(email: mail.from_address.to_s).
                        order('created_at desc').
                        first
    SupportRequest.create!(
      email:  mail.from_address.to_s,
      subject: mail.subject,
      body: mail.body.to_s,
      order:  recent_order
    )
---
SELECT "orders".* FROM "orders" WHERE "orders"."email" = ? ORDER BY created_at desc LIMIT ?  [["email", "Truls@outlook.com"], ["LIMIT", 1]]
INSERT INTO "support_requests" ("email", "subject", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "teruls"], ["subject", "Ødelagt§!§§§§§"], ["body", "WTF"], ["created_at", "2022-01-22 14:59:54.587675"], ["updated_at", "2022-01-22 14:59:54.587675"]]